# IFC_AttachPSetToZSG

## Description
Attaches Property Set to Zone, System or Group.

```pascal
FUNCTION IFC_AttachPSetToZSG(
				selector : INTEGER;
				ZSGName  : STRING;
				psetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_AttachPSetToZSG(selector, ZSGName, psetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|selector|INTEGER||
|ZSGName|STRING||
|psetName|STRING||

## Version
Availability: from Vectorworks 2022.1
## Category
* IFC